---
kind: method
id: M:Autodesk.Revit.DB.ElementLevelFilter.#ctor(Autodesk.Revit.DB.ElementId)
source: html/1e320bfe-e33b-bf92-a19c-134a071c6d26.htm
---
# Autodesk.Revit.DB.ElementLevelFilter.#ctor Method

Constructs a new instance of an ElementLevelFilter.

## Syntax (C#)
```csharp
public ElementLevelFilter(
	ElementId levelId
)
```

## Parameters
- **levelId** (`Autodesk.Revit.DB.ElementId`) - The id of the level that will be matched to elements' associated level.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null